scenarii/moving_twolayers.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"
[
<!ENTITY tmswest SYSTEM "/tms_west.xml">
<!ENTITY tmseast SYSTEM "/tms_east.xml">
<!ENTITY tmssouth SYSTEM "/tms_south.xml">
<!ENTITY tmsnorth SYSTEM "/tms_north.xml">
]
>
<!--

Author :  Rodolphe Quiedeville
Context : Tile server

Perform a bench on tile server

Require Tsung 1.5.0 minimal

This scenario implements predicitive moves

- start on a known point
- move one tile to the west
- move one tile to the north
- move one tile to the east
- move one tile to the south

-->
<tsung loglevel="notice" dumptraffic="protocol" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" />
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="20" unit="second">
      <users interarrival="1" unit="second" maxnumber="1"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">tsung 1.5.1</user_agent>
    </option>
  </options>

 <sessions>

   <session name='desktop' weight='9'  type='ts_http'>
     <!-- set the map size in pixel defined in the application
          in this case with a default tile's size of 256x256
          the map is a square 3x2 -->
     <setdynvars sourcetype="value" value="roads,rivers,sea">
       <var name="tms_layers" />
     </setdynvars>
     <setdynvars sourcetype="value" value="700">
       <var name="map_width" />
     </setdynvars>
     <setdynvars sourcetype="value" value="500">
       <var name="map_height" />
     </setdynvars>

     <!-- set the first url
	  Corresponding to the top left tile when accessing the
	  map for the first time
     -->
     <setdynvars sourcetype="value" value="13/4029/2857">
       <var name="first_url" />
     </setdynvars>

     <!-- First action -->
     <setdynvars sourcetype="erlang" callback="tms:move_first_layers">
       <var name="list_url" />
     </setdynvars>

     <transaction name="move_first">
       <foreach name="element" in="list_url">
         <request subst="true">
           <http url="/%%_element%%.png" method="GET" version="1.1"/>
         </request>
       </foreach>
     </transaction>

     <!-- Move west -->
     <transaction name="move_west">
       &tmswest;
     </transaction>

     <!-- Move  south -->
     <transaction name="move_south">
       &tmssouth;
     </transaction>

     <transaction name="move_east">
       &tmseast;
     </transaction>

     <transaction name="move_north">
       &tmsnorth;
     </transaction>

   </session>

 </sessions>
</tsung>